# LAB | Connecting Python to SQL
In this lab, the objective is to identify the customers who were active in both May and June, and how did their activity differ between months. To achieve this, follow these steps:

1. Establish a connection between Python and the Sakila database.

In [1]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine 

from getpass import getpass

In [2]:
password = getpass()

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/bank'
engine = create_engine(connection_string)

2. Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

- engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
- month: an integer representing the month for which rental data is to be retrieved.
- year: an integer representing the year for which rental data is to be retrieved.
The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

In [4]:
def rentals_month(month, year, engine):
    query = f'''SELECT * FROM sakila.rental WHERE MONTH(rental_date) = {month} AND YEAR(rental_date) = {year};'''
    data = pd.read_sql_query(query, engine)
    return data

df_rent_month = rentals_month(5, 2005, engine)
df_rent_month.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

3. Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

Hint: Consider making use of pandas groupby()

In [5]:
def rental_count_month(month, year, data):
    data = data[(data['rental_date'].dt.month == month) & (data['rental_date'].dt.year == year)]
    result = data.groupby('customer_id')['rental_id'].count()
    result = pd.DataFrame(result)
    column_name = f'rentals_{month}_{year}'
    result = result.rename(columns={'rental_id': column_name})
    return result

df_count = rental_count_month(5, 2005, df_rent_month)
df_count.head(10)

             rentals_5_2005
customer_id
1                         2
2                         1
3                         2
5                         3
6                         3
7                         5
8                         1
9                         3
10                        1
11                        1

4. Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [6]:
def compare_rentals(df1, df2):
    # Merge the DataFrames on 'customer_id'. We do an outer join in order to have all the ids "at the left" and all the ones "at the right".
    merged_df = df1.merge(df2, on='customer_id', how='outer')
    
    # Fill NaN values with 0, as no rentals means a count of 0
    merged_df.fillna(0, inplace=True)

    merged_df = merged_df.reset_index()

    merged_df = merged_df.astype(int)
    
    # Compute the difference in rentals
    merged_df['difference'] = merged_df.iloc[:, 2] - merged_df.iloc[:, 1]
    
    return merged_df


df_rm_1 = rentals_month(5, 2005, engine)
df_rm_2 = rentals_month(6, 2005, engine)
data_1 = rental_count_month(5, 2005, df_rm_1)
data_2 = rental_count_month(6, 2005, df_rm_2)
data_compare = compare_rentals(data_1,data_2)

Check.

In [7]:
data_compare.head(5)

   customer_id  rentals_5_2005  rentals_6_2005  difference
0            1               2               7           5
1            2               1               1           0
2            3               2               4           2
3            5               3               5           2
4            6               3               4           1

In [8]:
data_compare.shape

(598, 4)

In [10]:
# We check with the data in MySQl workbench.
data_compare[data_compare['customer_id']==4]

     customer_id  rentals_5_2005  rentals_6_2005  difference
520            4               0               6           6

In [11]:
data_compare[data_compare['customer_id']==101]

    customer_id  rentals_5_2005  rentals_6_2005  difference
84          101               1               0          -1